Revit 2026 API
RibbonPanel.AddSlideOut Method
 Adds a slideout to the current panel.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void AddSlideOut()
Public Sub AddSlideOut
public:
void AddSlideOut()
member AddSlideOut : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException | Thrown when a slide out panel is already added.
Remarks
 The slideout part of the panel can be shown by clicking on the arrow at the bottom of the panel. After calling AddSlideOut(), any subsequent calls to add new items will add the new item(s) to the slideout. The slideout part of the panel will be shown only if items are added after this call.
See Also
Reference
RibbonPanel Class
Autodesk.Revit.UI Namespace